BusinessProcesses/СогласованиеРеестровБезКурирующего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеРеестровБезКурирующего</Name>
			<Task>Task.ЗадачаИсполнителяПоСогласованиюПлатежей</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодписанПредседателем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромФДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДиректоромКДВыполнена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ден_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦС_СостоянияСогласованияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрСогласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурирующийЧП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорФД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПередачаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомментарииПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представительство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Представительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФинансирование</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСогласующего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаФилиалы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.б_ЗаявкаНаФинансирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаФинансированиеПредставительств</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПредставительств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаСХТП</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоФорвардномуЗакупуСХТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПоФорвардномуЗакупу</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоФорвардномуЗакупу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПоЗакупу</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПоЗакупу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭСФ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ЦС_АдресацияБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦС_АдресацияБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_ПодразделенияДляБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СобственныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СобственныеКонтрагенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПлатежиПредставительств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежиЦА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансированиеПредставительств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежиОбластей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/СогласованиеРеестровБезКурирующего/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьКарту(Команда) // Обработчик команды формы 
	ОбновитьКартуСервер();  	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьКартуСервер() // Серверная контекстная процедура получения карты маршрута 
	// Конвертируем объект формы в объект бизнес-процесса
	ОбъектБП = РеквизитФормыВЗначение("Объект"); 
	// Вызываем метод получения карты маршрута текущего бизнес-процесса
	Карта = ОбъектБП.ПолучитьКартуМаршрута();      	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущееСостояниеБП()
	ОбновитьКартуСервер();
	Если не ЗначениеЗаполнено(ТекущаяТочка) тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.ТочкаМаршрута,
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителяПоСогласованиюПлатежей КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &Ссылка
		|	И НЕ ЗадачаИсполнителя.Выполнена";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекущаяТочка 	= ВыборкаДетальныеЗаписи.точкамаршрута;
			Задача 			= ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если параметры.Свойство("Задача") тогда
		Задача 			= Параметры.Задача;
		ТекущаяТочка 	= Параметры.Задача.ТочкаМаршрута;	
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		ПолучитьТекущееСостояниеБП();
		ПодготовитьФорму(ЭтаФорма);
	КонецЕсли;
		
	ТекущийИсполнитель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ОбновитьИсториюИзменений()
	
	ИсторияИсполнения = "";
	Комментарии.Очистить();
	Для Каждого СтрокаТЧ из Объект.КомментарииПроцесса Цикл
		ИсторияИсполнения = ИсторияИсполнения + Символы.ПС +"["+ СтрокаТЧ.Автор +"]"+ " *** " +СтрокаТЧ.Дата + Символы.Таб + СтрокаТЧ.Комментарий+Символы.ПС;	
	КонецЦикла;
	Макет = БизнесПроцессы.СогласованиеРеестровБезКурирующего.ПолучитьМакет("Макет");
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Комментарии.Вывести(Обл);
	Обл = Макет.ПолучитьОбласть("Строка");
	
	Для каждого СтрокаТЧ Из объект.КомментарииПроцесса Цикл
		Обл.Параметры.Заполнить(СтрокаТЧ);
		Комментарии.Вывести(Обл);
	КонецЦикла;
	
	
КонецПроцедуры
	

&НаКлиенте
Процедура ПлатежноеПоручениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЗначение(ПлатежноеПоручение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьФорму(Форма)
	         
	Объект 			= Форма.Объект;
	Элементы 		= Форма.Элементы;	
	ТекущаяТочка 	= Форма.ТекущаяТочка;
	Задача			= Форма.Задача;
	
	Если Объект.стартован 
		и не ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.РаботаСЗаявкойАвтором") тогда
		элементы.левая.толькопросмотр 		= истина;
		Элементы.правая.Толькопросмотр		= Истина;
		
		Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		Элементы.ПлатежиЗаполнить.Видимость = Ложь;

	КонецЕсли;

	Если задача.Выполнена тогда
		Форма.ТолькоПросмотр = Истина;
		Сообщить("Текущий этап выполнен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	Если объект.Завершен тогда
		Форма.ТолькоПросмотр = Истина;
		Форма.Элементы.Группа1.Видимость = ложь;
		
		Сообщить("Бизнес-процесс завершен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	
	
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СогласованиеСДиректоромФД")	тогда
		Элементы.ПроверкаДиректоромФДВыполнена.Доступность 		= Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СогласованиеСДиректоромКД")	тогда
		Элементы.ПроверкаДиректоромКДВыполнена.Доступность 		= Истина;
	//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.ПроверкаВР")				тогда
	//	Элементы.ПодписанПредседателем.Доступность 				= Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.РаботаСЗаявкойАвтором")
		или не ЗначениеЗаполнено(ТекущаяТочка) тогда
		Элементы.вернутьнадоработку.видимость 				= Ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.видимость 		= Ложь;
	//ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СозданиеПП")	тогда
	//	Элементы.ВыполнитьЭтап.Заголовок = "Ознакомлен";
	//	Элементы.ВернутьНаДоработку.Видимость = Ложь;
	//	Элементы.ОтказатьВПоставленнойЗадаче.Видимость = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЭтап(Команда)
	ОбработатьБП("ОК");
	ОповеститьОбИзменении(ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	ОбработатьБП("Возврат");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПоставленнойЗадаче(Команда)
	ОбработатьБП("Отказ");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБП(РезультатВозврата)
	
	//-=-=
	Если Не РольДоступна("axm_ОтключитьКонтрольСоотвествияИсполнителейВСогласованиях")
		И глТекущийПользователь <> ЭтотОбъект.Задача.Пользователь Тогда
		Сообщить("На текущем этапе согласовывать должен " + ЭтотОбъект.Задача.Пользователь + "!");
		Возврат;
	КонецЕсли;
	//-=-=
	
	Если не ОбработатьЭтап(РезультатВозврата) тогда
		Возврат;
	КонецЕсли;
	
	Если КомментарийИсполнителя <> "" тогда
		НС = объект.КомментарииПроцесса.Добавить();
		НС.Автор = ТекущийИсполнитель;
		НС.Дата = ТекущаяДата();
		НС.Комментарий = КомментарийИсполнителя ;
		НС.Этап = ТекущаяТочка;
	КонецЕсли;
	
	НоваяЗапись = Объект.Подписи.Добавить();
	НоваяЗапись.Дата				= ТекущаяДата();
	НоваяЗапись.Этап			    = ТекущаяТочка;
	НоваяЗапись.Автор				= Пользователи.ТекущийПользователь();

	Записать();
	
	
	Если не Задача.Пустая() тогда
		ВыполнитьЗадачу(Задача);
	Иначе
		Стартовать();
	КонецЕсли;
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	Закрыть();	
	  
КонецПроцедуры

Процедура Стартовать()
	БП = РеквизитФормыВЗначение("Объект");
	БП.Старт();
	ЗначениеВРеквизитФормы(БП,"Объект");
КонецПроцедуры

&НаКлиенте
Функция ОбработатьЭтап(РезультатВозврата)
	
	Если РезультатВозврата = "ОК" Тогда
		ЗначениеВозврата = Истина;
	ИначеЕсли РезультатВозврата = "Возврат" или РезультатВозврата = "Отказ" Тогда
		Если КомментарийИсполнителя = "" Тогда
			Предупреждение("Не указана причина в комментарии текущего исполнителя");
			ЗначениеВозврата = Ложь;
		Иначе
			ЗначениеВозврата = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатВозврата = "ОК" Тогда 
		ЗначениеПоля = "Разрешено";
	ИначеЕсли РезультатВозврата = "Возврат" Тогда
		ЗначениеПоля = "Возвращено";
	Иначе
		ЗначениеПоля = "Отказано";
	КонецЕсли;
		
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СогласованиеСДиректоромФД")	Тогда
		Объект.ПроверкаДиректоромФДВыполнена = ЗначениеПоля;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СогласованиеСДиректоромКД")	Тогда
		Объект.ПроверкаДиректоромКДВыполнена = ЗначениеПоля;	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СозданиеПП") Тогда
		Объект.ПроверкаПередачаНаОплату = ЗначениеПоля;
	КонецЕсли;	
	
	 Возврат ЗначениеВозврата;
	 
КонецФункции


&НаСервереБезКонтекста
Функция ВыполнитьЗадачу(Задача)
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьТекущееСостояниеБП();
	ПодготовитьФорму(ЭтаФорма);
	ОбновитьИсториюИзменений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь,
	|	ЦС_АдресацияБизнесПроцессов.Подразделение
	|ИЗ
	|	РегистрСведений.ЦС_АдресацияБизнесПроцессов КАК ЦС_АдресацияБизнесПроцессов
	|ГДЕ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь = &глТекущийПользователь";
	
	Запрос.УстановитьПараметр("глТекущийПользователь", параметрысеанса.текущийпользователь);	
	
	ТолькоПросмотр								= истина;
	элементы.Группа1.Доступность				= Ложь;
	элементы.ФормаКоманднаяПанель.Доступность	= Ложь;	
	
	Если (Не ТекущийОбъект.стартован)
		Или параметрысеанса.текущийпользователь = Задача.Пользователь
		Или Запрос.Выполнить().Выгрузить().НайтиСтроки(Новый Структура("Пользователь, Подразделение", параметрысеанса.текущийпользователь, Задача.Подразделение)).Количество() <> 0
		Или РольДоступна("ПолныеПрава") тогда
		
		Если (НЕ ТекущийОбъект.Завершен) Тогда
			
			ТолькоПросмотр = ложь;
			элементы.Группа1.Доступность = Истина;
			элементы.ФормаКоманднаяПанель.Доступность = Истина;
		КонецЕсли;
		
	иначе
		Сообщить("Этап не предусматривает исполнение текущим пользователем. Форма заблокирована");
	КонецЕсли;
	
	//Если Параметры.Задача.Выполнена тогда
	//	ЭтаФорма.ТолькоПросмотр	= Истина;
	//	ЭтаФорма.Элементы.Группа1.Доступность = Ложь;
	//КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,ЭлементФормы,);

	//// Владельца менять по умолчанию не даем.
	//ФормаВыбора.ПараметрОтборПоВладельцу = Контрагент;

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	              	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Контрагент;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетКонтрагента =ФормаСчета.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Организация;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	ФормаСчета.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	
	ФормаСчета.Отбор.Источникфинансирования.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Источникфинансирования.Использование = Истина;
	ФормаСчета.отбор.Источникфинансирования.Значение = Объект.источникфинансирования;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетОрганизации = ФормаСчета.ОткрытьМодально();
	
// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РольДоступна("СкрытыеПапкиСогласованиеРеестров") Тогда
		ЭтаФорма.Элементы.ТипПлатежа.Видимость = Ложь;
		ЭтаФорма.Элементы.КурирующийЧП.Видимость = Ложь;
		ЭтаФорма.Элементы.ПроверкаДиректоромФДВыполнена.Видимость = Ложь;
		ЭтаФорма.Элементы.ПроверкаДиректоромКДВыполнена.Видимость = Ложь;
		//ЭтаФорма.Элементы.ПодписанПредседателем.Видимость = Ложь;
		ЭтаФорма.Элементы.ДатаНачала.Видимость = Ложь;
		ЭтаФорма.Элементы.ДатаОкончания.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиВалюта.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиРасчетныйСчет.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКомментарийСогласующего.Видимость = Ложь;
		ЭтаФорма.Элементы.СтраницаКарта.Видимость = Ложь;
		ЭтаФорма.Элементы.Комментарии1.Видимость = Ложь;


	КонецЕсли;

	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
		
	Если Объект.РеестрСогласован = Истина И ТекущаяТочка <> ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестровБезКурирующего.ТочкаМаршрута.СозданиеПП") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
		Сообщить("Реестр согласован и не может быть изменен");
	КонецЕсли;
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ФинансированиеПредставительств Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиДоговор.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;

		ЭтаФорма.Элементы.ПлатежиКонтрагент.Заголовок = "Представительство";
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Истина;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансированиеПредставительств.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	    ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Истина;
	
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
	КонецЕсли;



КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокФайлов.ТекущаяСтрока;
	
	Если СокрЛП(ТекСтрока.Наименование) = "" Тогда
	 	СтандартнаяОбработка = Истина;
		Сообщить("Введите описание файла");
	Иначе
		СтандартнаяОбработка = Ложь;
		УниверсальныеМеханизмы.ОткрытьФайлы(Элементы.СписокФайлов.ТекущиеДанные, глТекущийПользователь, Элементы.СписокФайлов.ВыделенныеСтроки);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьФайла(ПолноеИмяФайла, Каталог)
	
	НовОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	НовОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолноеИмяФайла), Новый СжатиеДанных);
	НовОбъектХранилища.ИмяФайла = Сред(ПолноеИмяФайла, СтрДлина(Каталог) + 1);
	НовОбъектХранилища.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	НовОбъектХранилища.Объект = Объект.Ссылка;
	НовОбъектХранилища.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Диалог = УниверсальныеМеханизмы.ПолучитьДиалогВыбораФайлов(Ложь);
		
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	Попытка  		
		СоздатьЗаписьФайла(Диалог.ПолноеИмяФайла, Диалог.Каталог); 		
		Элементы.СписокФайлов.Обновить();
	Исключение
		Сообщить("" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокФайлов.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Платежи.Количество() <> 0 Тогда
		Ответ = Вопрос("Таблица не пуста. Перезаполнить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Платежи.Очистить();
		КонецЕсли;
	КонецЕсли;
    Таблица = Объект.Платежи;
	 
	ЗаполнитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиПредставительств Тогда

	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Контрагент,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.НазначениеПлатежа,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СуммаДокумента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СчетОрганизации,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Представительство
			|ИЗ
			|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
			|ГДЕ
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СогласованоБП = ИСТИНА
			|	И НЕ ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления
			|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.УтверженоК = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Сообщить("На заданный период не обнаружены документы");
			Возврат;
		КонецЕсли;	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
		   Строка = Объект.Платежи.Добавить();
					
				Строка.Поручение 			= Выборка.Ссылка;
				Строка.Представительство    = Выборка.Представительство;
				Строка.РасчетныйСчет        = Объект.Организация.ОсновнойБанковскийСчет;//Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005491");
				Строка.Договор 			    = Выборка.ДоговорКонтрагента;
				Строка.Контрагент 		    = Выборка.Контрагент;
				Строка.СуммаПлатежа   	    = Выборка.СуммаДокумента;
				Строка.НазначениеПлатежа    = Выборка.НазначениеПлатежа;
				Строка.Валюта      		    = Выборка.ВалютаДокумента;
				Строка.Представительство    = Выборка.Представительство;
			КонецЦикла;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СуммаПоЗаявке,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Примечание,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Организация,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Контрагент
				|ИЗ
				|	Документ.б_ЗаявкаНаФинансирование.РасчетнаяТаблица КАК б_ЗаявкаНаФинансированиеРасчетнаяТаблица
				|ГДЕ
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				|	И НЕ б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.ПометкаУдаления
				|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СуммаПоЗаявке <> 0";
			
			Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда 
				Сообщить("На заданный период не обнаружены документы");
				Возврат;
			КонецЕсли;	
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Значение = Выборка.Организация;
				НаборЗаписей.Отбор.Организация.Использование = Истина;
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					КонтрагентОрганизации = НаборЗаписей[0].Контрагент;
				Иначе
					КонтрагентОрганизации = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;

			   Строка = Объект.Платежи.Добавить();
						
				Строка.Контрагент		    = КонтрагентОрганизации;
				Строка.КонтрагентПолучатель = Выборка.Контрагент;
				Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
				Строка.НазначениеПлатежа    = Выборка.Примечание;
				Строка.Валюта      		    = Справочники.Валюты.НайтиПоКоду("398");
				Строка.ЗаявкаФилиалы        = Выборка.Ссылка;

			КонецЦикла;
				
		КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦАНаСервере()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеПлатежейПодписи.Ссылка
		|ПОМЕСТИТЬ ВТ_СогласованияСОтказами
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежей.Подписи КАК СогласованиеПлатежейПодписи
		|ГДЕ
		|	НЕ СогласованиеПлатежейПодписи.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПодписи.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПодписи.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПодписи.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПодписи.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И СогласованиеПлатежейПодписи.Статус = ""Отказано""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейРасчетнаяТаблица.Договор,
		|	СогласованиеПлатежейРасчетнаяТаблица.СуммаПоЗаявке,
		|	СогласованиеПлатежейРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейРасчетнаяТаблица.ВалютаДокумента,
		|	СогласованиеПлатежейРасчетнаяТаблица.ТипОперации,
		|	СогласованиеПлатежейРасчетнаяТаблица.СтатьяДвиженияДенежныхСредств,
		|	СогласованиеПлатежейРасчетнаяТаблица.СчетКонтрагента,
		|	СогласованиеПлатежейРасчетнаяТаблица.ЭСФ
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежей.РасчетнаяТаблица КАК СогласованиеПлатежейРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СогласованияСОтказами.Ссылка
		|				ИЗ
		|					ВТ_СогласованияСОтказами КАК ВТ_СогласованияСОтказами)";
	
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
	   
		    Строка.ЗаявкаНаФинансирование = Выборка.Ссылка;
			Строка.РасчетныйСчет        = Объект.Организация.ОсновнойБанковскийСчет;//Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005491");
			Строка.Договор 			    = Выборка.Договор;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
			Строка.НазначениеПлатежа    = Выборка.Примечание;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
			//Рамиль +
			Строка.ТипОперации			= Выборка.ТипОперации;
			Строка.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			Строка.СчетКонтрагента		= Выборка.СчетКонтрагента;
			Строка.ЭСФ					= Выборка.ЭСФ;
			//Рамиль -
			
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦА(Команда)
	ЗаполнитьЦАНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежаПриИзменении(Элемент)
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;

	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ФинансированиеПредставительств Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиДоговор.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;

		ЭтаФорма.Элементы.ПлатежиКонтрагент.Заголовок = "Представительство";
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансированиеПредставительств.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	    ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Организация));
		
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
		
	//+++ Oleg SmartT. 2021-11-01	
	ТекСтрока = ЭтаФорма.Элементы.Платежи.ТекущиеДанные; //ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Предупреждение("Выберите заявку из таблицы");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ЗаявкаНаФинансирование) Тогда
		ТекСтрока_Заявка = ТекСтрока.ЗаявкаНаФинансирование;
	ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ЗаявкаСХТП) Тогда
		ТекСтрока_Заявка = ТекСтрока.ЗаявкаСХТП;
	ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ЗаявкаПоФорвардномуЗакупу) Тогда
		ТекСтрока_Заявка = ТекСтрока.ЗаявкаПоФорвардномуЗакупу;
	ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ЗаявкаПоЗакупу) Тогда
		ТекСтрока_Заявка = ТекСтрока.ЗаявкаПоЗакупу;
    КонецЕсли;
	//--- Oleg SmartT. 2021-11-01	

	ПараметрыФ = Новый Структура;
	Заголовок = НСтр("ru = 'Присоединенные файлы'");
	ПараметрыФ.Вставить("ЗаголовокФормы", Заголовок);
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ПараметрыФ.Вставить("ВладелецФайла", ТекСтрока.ЗаявкаНаФинансированиеПредставительств);

		ОткрытьФорму(
		"Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", 
		ПараметрыФ,
		ТекСтрока.ЗаявкаНаФинансированиеПредставительств, 
		ТекСтрока.ЗаявкаНаФинансированиеПредставительств, 
		);

	Иначе
		ПараметрыФ.Вставить("ВладелецФайла", ТекСтрока_Заявка);

		ОткрытьФорму(
			"Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", 
			ПараметрыФ,
			ТекСтрока_Заявка, 
			ТекСтрока_Заявка, 
			);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОПНаСервере()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеПлатежейПредставительствПодписи.Ссылка
		|ПОМЕСТИТЬ ВТ_СогласованияСОтказами
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПредставительств.Подписи КАК СогласованиеПлатежейПредставительствПодписи
		|ГДЕ
		|	НЕ СогласованиеПлатежейПредставительствПодписи.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПредставительствПодписи.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПредставительствПодписи.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПредставительствПодписи.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПредставительствПодписи.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И СогласованиеПлатежейПредставительствПодписи.Статус = ""Отказано""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейРасчетнаяТаблица.Договор,
		|	СогласованиеПлатежейРасчетнаяТаблица.СуммаПоЗаявке,
		|	СогласованиеПлатежейРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейРасчетнаяТаблица.ВалютаДокумента
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПредставительств.РасчетнаяТаблица КАК СогласованиеПлатежейРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СогласованияСОтказами.Ссылка
		|				ИЗ
		|					ВТ_СогласованияСОтказами КАК ВТ_СогласованияСОтказами)";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
	   
		    Строка.ЗаявкаНаФинансированиеПредставительств = Выборка.Ссылка;
			Строка.РасчетныйСчет        = Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005491");
			Строка.Договор 			    = Выборка.Договор;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
			Строка.НазначениеПлатежа    = Выборка.Примечание;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОП(Команда)
	ЗаполнитьОПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСХТПНаСервере()
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.Текст = 
	//+++ Oleg SmartT. 2021-10-07	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка
		|ПОМЕСТИТЬ ВТ_СогласованияСОтказами
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.Подписи КАК СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТППодписи.Статус = ""Отказано""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупу.Подписи КАК СогласованиеПлатежейПоФорвардномуЗакупуПодписи
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И СогласованиеПлатежейПоФорвардномуЗакупуПодписи.Статус = ""Отказано""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеПлатежейПоЗакупуПодписи.Ссылка
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоЗакупу.Подписи КАК СогласованиеПлатежейПоЗакупуПодписи
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоЗакупуПодписи.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоЗакупуПодписи.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоЗакупуПодписи.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоЗакупуПодписи.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоЗакупуПодписи.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И СогласованиеПлатежейПоЗакупуПодписи.Статус = ""Отказано""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.НомерДоговора КАК Договор,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.ДатаДоговора,
		|	ВЫБОР
		|		КОГДА СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.ДопОплата
		|			ТОГДА СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.СуммаДоплаты
		|		ИНАЧЕ СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.СуммаПогашенияСельхозПродукцией
		|	КОНЕЦ КАК СуммаПоЗаявке,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.НомерДоговора.ВалютаВзаиморасчетов КАК ВалютаДокумента,
		|	СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.СуммаДоговора
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.РасчетнаяТаблица КАК СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И НЕ СогласованиеПлатежейПоФорвардномуЗакупуСХТПРасчетнаяТаблица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СогласованияСОтказами.Ссылка
		|				ИЗ
		|					ВТ_СогласованияСОтказами КАК ВТ_СогласованияСОтказами)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.НомерДоговора,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.ДатаДоговора,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.СуммаДоговора,
		|	СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.НомерДоговора.ВалютаВзаиморасчетов,
		|	NULL
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупу.РасчетнаяТаблица КАК СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И НЕ СогласованиеПлатежейПоФорвардномуЗакупуРасчетнаяТаблица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СогласованияСОтказами.Ссылка
		|				ИЗ
		|					ВТ_СогласованияСОтказами КАК ВТ_СогласованияСОтказами)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаДоговора,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
		|	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.ВалютаВзаиморасчетов,
		|	NULL
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПоЗакупу.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка.ЗаявкаВключенаВРеестр = ЛОЖЬ
		|	И НЕ СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_СогласованияСОтказами.Ссылка
		|				ИЗ
		|					ВТ_СогласованияСОтказами КАК ВТ_СогласованияСОтказами)";
	//--- Oleg SmartT. 2021-10-07	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Платежи.Добавить();
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоФорвардномуЗакупу") Тогда
			Строка.ЗаявкаПоФорвардномуЗакупу = Выборка.Ссылка;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоФорвардномуЗакупуСХТП") Тогда
			Строка.ЗаявкаСХТП = Выборка.Ссылка;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПредставительств") Тогда
			Строка.ЗаявкаНаФинансированиеПредставительств = Выборка.Ссылка;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоЗакупу") Тогда
			Строка.ЗаявкаПоЗакупу = Выборка.Ссылка;
		КонецЕсли;
		
		Строка.РасчетныйСчет     = Объект.Организация.ОсновнойБанковскийСчет;//Справочники.БанковскиеСчета.НайтиПоКоду("ПР0005491");
		Строка.Договор 			 = Выборка.Договор;
		Строка.Контрагент 		 = Выборка.Контрагент;
		Строка.СуммаПлатежа   	 = Выборка.СуммаПоЗаявке;
		Если Строка.СуммаПлатежа = 0 и ЗначениеЗаполнено(Строка.ЗаявкаСХТП) Тогда
			Строка.СуммаПлатежа = Выборка.СуммаДоговора;
		КонецЕсли;
		Строка.НазначениеПлатежа = Выборка.Примечание;
		Строка.Валюта      		 = Выборка.ВалютаДокумента;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСХТП(Команда)
	ЗаполнитьСХТПНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьППИНаСервере(Массив)
	
	Для Каждого СтрокаЗаписи из Объект.Платежи Цикл
		ДобДокумент = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
		ДобДокумент.Контрагент = СтрокаЗаписи.Контрагент;
		ДобДокумент.ДокументОснование = Объект.Ссылка;
		ДобДокумент.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
		ДобДокумент.Дата = ТекущаяДата();
		ДобДокумент.ТипОперации = СтрокаЗаписи.ТипОперации;
		ДобДокумент.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
		ДобДокумент.ВидУчетаНУ = Справочники.ВидыУчетаНУ.НУ;
		ДобДокумент.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
		ДобДокумент.СчетУчетаРасчетовСоСтруктурнымПодразделением = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
		ДобДокумент.СуммаДокумента = СтрокаЗаписи.СуммаПлатежа;
		ДобДокумент.СчетОрганизации = СтрокаЗаписи.РасчетныйСчет;
		ДобДокумент.СчетКонтрагента = СтрокаЗаписи.СчетКонтрагента; 
		ДобДокумент.СчетБанк = ПланыСчетов.Типовой.ДенежныеСредстваНаТекущихБанковскихСчетахСоб;
		//ДобДокумент.ВидНалога = Справочники.НалогиСборыОтчисления.	
		ДобДокумент.ВалютаДокумента = СтрокаЗаписи.Валюта;
		ДобДокумент.БанкПосредник = СтрокаЗаписи.РасчетныйСчет.Банк;
		ДобДокумент.Организация = Объект.Организация;
		ДобСтрока = ДобДокумент.РасшифровкаПлатежа.Добавить();
		ДобСтрока.ДоговорКонтрагента = СтрокаЗаписи.Договор;
		ДобСтрока.СчетУчетаРасчетовСКонтрагентомБУ = ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
		ДобСтрока.СуммаПлатежа = СтрокаЗаписи.СуммаПлатежа;
		ДобСтрока.СтатьяДвиженияДенежныхСредств = СтрокаЗаписи.СтатьяДвиженияДенежныхСредств;
		ДобСтрока.ИсточникФинансирования = Справочники.ИсточникиФинансирования.СобственныеСредства;
		ДобСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоКоду("000000001");
		ДобДокумент.ОтражатьВБухгалтерскомУчете = Истина;
		ДобДокумент.ОтраженоВОперУчете = Истина;
		ДобДокумент.УчитыватьКПН = Истина;
		ДобДокумент.РННПлательщика = Объект.Организация.РНН;
		ДобДокумент.РННПолучателя = СтрокаЗаписи.Контрагент.РНН;
		ДобДокумент.ДатаВалютирования = ДобДокумент.Дата;
		ДобДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДобДокумент.Представительство = Справочники.Представительства.НайтиПоКоду("000000008");
		ДобДокумент.ТекстПлательщика = Строка(Объект.Организация);
		ДобДокумент.ТекстПолучателя = Строка(СтрокаЗаписи.Контрагент);
		ДобДокумент.НазначениеПлатежа = Строка(Объект.Назначение)+" на основании договора "+СтрокаЗаписи.Договор+", согласно ЭСФ №"+СтрокаЗаписи.ЭСФ.Номер+" от "+Формат(СтрокаЗаписи.ЭСФ.Дата, "ДФ=dd.MM.yyyy")+"";
		ДобДокумент.Записать(РежимЗаписиДокумента.Запись);
		Массив.Добавить(ДобДокумент.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьППИ(Команда)
	МассивДокументов = Новый Массив;
	СоздатьППИНаСервере(МассивДокументов);
	Для Каждого СтрокаДок Из МассивДокументов Цикл
		ОткрытьЗначение(СтрокаДок);
	КонецЦикла;
КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ТипПлатежаНачалоВыбораНаСервере()
//	Если РольДоступна("СкрытыеПапкиСогласованиеРеестров") Тогда
//		ЭтаФорма.Элементы.ТипПлатежа.Видимость = Ложь;
//КонецПроцедуры

//&НаКлиенте
//Процедура ТипПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СП = Новый СписокЗначений
//	СП.Вставить(Перечисления.ТипыПлатежей.ПлатежиПредставительств);
//	СП.Вставить(Перечисления.ТипыПлатежей.ФинансированиеПредставительст);
//	
//	Если РольДоступна("Пользователь") Тогда
//		ЭтаФорма.Элементы.ТипПлатежа = СП;
//КонецПроцедуры
